{
  "backend/main.mo": "Defines actor modules for profiles, booking requests, messages, monetization, and persistent state, including maps, types, and compare functions.",
  "backend/migration.mo": "Provides types for old/new actor state and a migration function adding a new companionFeePaid map.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of many frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS setup with theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global layout, auth/age guards, and routes for public, admin, profile, and messaging pages.",
  "frontend/src/components/admin/ProfileStatusBadge.tsx": "Renders a badge showing a companion profile's status using variant and label mappings.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with React Query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting newly authenticated users to enter and save their name, using profile queries and mutation hooks.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Dialog for submitting a booking request with form fields, validation, and backend mutation.",
  "frontend/src/components/companions/CompanionCard.tsx": "Displays a companion’s image, name, description, and category in a clickable card linking to their profile.",
  "frontend/src/components/companions/CompanionGallery.tsx": "Image gallery with modal viewer allowing navigation between photos for a companion profile.",
  "frontend/src/components/compliance/AgeGateModal.tsx": "Modal prompting users to confirm age eligibility before entering adult content.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Wrapper enforcing admin-only access, showing login or denied screens based on authentication and authorization.",
  "frontend/src/components/guards/RequireAgeGate.tsx": "Guard that checks stored age confirmation and shows the age gate modal if not confirmed.",
  "frontend/src/components/guards/RequireAuth.tsx": "Wrapper that requires authentication, showing a sign‑in prompt when the user is not logged in.",
  "frontend/src/components/layout/EditorialSection.tsx": "Layout utilities for editorial sections, including headings, subheads, and dividers.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying branding, legal links, browsing links, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation links that adapt based on authentication state and admin role, including mobile menu handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAuthz.ts": "Fetches and exposes user authorization state, including authentication, role, and admin status using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating profiles, bookings, messages, and earnings through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles with custom light/dark themes and serif font import for the application's visual design.",
  "frontend/src/lib/errorFormatting.ts": "Maps backend error messages to user-friendly strings with custom handling for auth, fee, and existence errors.",
  "frontend/src/main.tsx": "App entrypoint that sets up React Query and Internet Identity providers before rendering the application.",
  "frontend/src/pages/admin/AdminBookingDetailPage.tsx": "Admin page showing detailed booking info with controls to update booking status and invalidate earnings queries.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Displays all bookings with tab-based filtering by status and a table of booking details with actions.",
  "frontend/src/pages/admin/AdminEarningsPage.tsx": "Shows platform earnings, active monetization model, and recent completed bookings using cards and tables.",
  "frontend/src/pages/admin/AdminMonetizationSettingsPage.tsx": "Provides a form for selecting and configuring the platform’s monetization model and its fee parameters.",
  "frontend/src/pages/admin/AdminProfileEditorPage.tsx": "Form for creating or editing profiles with fields for details, status, and languages, saving via mutation.",
  "frontend/src/pages/admin/AdminProfilesPage.tsx": "Lists all profiles with status badges and actions to edit or change activation status.",
  "frontend/src/pages/BrowseCompanionsPage.tsx": "Browse page that displays active companion profiles with search and category filtering, showing loading and empty states.",
  "frontend/src/pages/CompanionProfilePage.tsx": "Displays a companion’s profile with photos, details, availability, and a booking button requiring authentication.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero content, feature highlights, and calls to action directing users to browse companions.",
  "frontend/src/pages/messages/MessagesConversationPage.tsx": "Displays a message thread between the signed-in user and a selected counterpart, loads messages, shows profile info, and allows sending new messages.",
  "frontend/src/pages/messages/MessagesInboxPage.tsx": "Shows all user message threads, merges duplicates, displays counterpart profiles, and links into individual conversations.",
  "frontend/src/pages/MyCompanionProfilePage.tsx": "Allows authenticated users to create or edit their own companion profile with form fields and fee confirmation.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page describing data collection, use, storage, and user rights.",
  "frontend/src/pages/TermsDisclaimerPage.tsx": "Static terms and disclaimer page outlining age requirements, legal boundaries, and platform responsibilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and removing or retrieving them across navigations.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugin integrations for the frontend UI.",
  "project_state.json": "Holds the project’s current state, feature list, and metadata describing the app’s direction and implemented requirements."
}