{
  "backend/main.mo": "Defines user, companion, and booking data models with access-controlled CRUD operations using authorization mixins and in‑memory maps.",
  "feature_evidence.json": "Lists feature evidence mapping implemented app features to specific frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of key frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet configuring CSS variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Basic HTML entrypoint that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, guards, and theming for public and admin pages.",
  "frontend/src/components/admin/ProfileStatusBadge.tsx": "Badge component that displays a companion profile’s status with variant‑based styling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and fallback handling for auth errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to set their display name and saving it via backend queries.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Booking request form dialog that validates input, builds a Request object, and submits it via mutateAsync.",
  "frontend/src/components/companions/CompanionCard.tsx": "Displays a companion’s photo, name, description, and basic info inside a clickable card linking to their profile.",
  "frontend/src/components/companions/CompanionGallery.tsx": "Renders a gallery of images with a modal viewer supporting navigation and close controls.",
  "frontend/src/components/compliance/AgeGateModal.tsx": "Modal requiring users to confirm they are 18+ with accept and decline actions.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Wrapper that checks authentication and admin status, showing login or denial messages before rendering children.",
  "frontend/src/components/guards/RequireAgeGate.tsx": "Checks local storage for age confirmation and shows the age gate modal if not verified.",
  "frontend/src/components/guards/RequireAuth.tsx": "Ensures a user is authenticated, showing a sign‑in prompt if not.",
  "frontend/src/components/layout/EditorialSection.tsx": "Provides styled editorial layout components including section, headline, subhead, and divider.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, legal links, navigation, and a dynamic attribution section.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with navigation, admin links, login button, and a responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating and refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides auth-related React queries to fetch the caller's role and admin status and returns combined authorization state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for loading, storing, and managing user identity and login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, bookings, and user profile CRUD operations using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind layers and custom CSS variables for light/dark themes with a luxury palette and serif font.",
  "frontend/src/lib/errorFormatting.ts": "Formats errors into user-friendly messages with special handling for common error types.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminBookingDetailPage.tsx": "Admin page showing detailed booking info with status updates and navigation.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Admin bookings list with filtering tabs, status badges, and navigation to detail views.",
  "frontend/src/pages/admin/AdminProfileEditorPage.tsx": "Admin form for creating or editing companion profiles with validation and submission handling.",
  "frontend/src/pages/admin/AdminProfilesPage.tsx": "Admin UI page that lists all profiles, allows navigation to create or edit pages, and supports changing profile status via a dropdown.",
  "frontend/src/pages/BrowseCompanionsPage.tsx": "Displays active companion profiles with search and category filtering and renders matching companion cards.",
  "frontend/src/pages/CompanionProfilePage.tsx": "Shows a detailed companion profile page with gallery, bio, and booking button gated by authentication.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero, feature highlights, and calls to action linking to the browse page.",
  "frontend/src/pages/PrivacyPage.tsx": "Privacy policy page outlining data collection, usage, storage, rights, and contact info.",
  "frontend/src/pages/TermsDisclaimerPage.tsx": "Terms and disclaimer page covering age requirements, legality, booking rules, and liability limits.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routes.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing features, requirements, assets, and current development state."
}