{
  "backend/main.mo": "Defines actor with companion profiles, booking requests, messages, monetization config, and access control plus related types and maps.",
  "backend/migration.mo": "Provides migration logic copying actor state while enforcing a 30% commission monetization config.",
  "feature_evidence.json": "Feature evidence report linking admin UI commission-rate feature to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend files across pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with custom color tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global layout, guards, and route definitions for public, authenticated, and admin pages.",
  "frontend/src/components/admin/ProfileStatusBadge.tsx": "Renders a styled badge showing a companion profile’s status based on enum value.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button that clears React Query cache on logout and handles auth errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter their name and save an initial user profile.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Dialog component for submitting a booking request, including form fields, validation, and mutation handling.",
  "frontend/src/components/companions/CompanionCard.tsx": "Displays a companion profile card with image, name, description, category, and location, linking to the profile page.",
  "frontend/src/components/companions/CompanionGallery.tsx": "Image gallery with clickable thumbnails and a modal viewer supporting navigation and close actions.",
  "frontend/src/components/compliance/AgeGateModal.tsx": "Modal that requires users to confirm they are 18+ or decline and exit the site.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Wrapper that restricts content to authenticated admin users, showing login, loading, or denial states.",
  "frontend/src/components/guards/RequireAgeGate.tsx": "Gatekeeper component that checks localStorage for age confirmation and shows the age verification modal if needed.",
  "frontend/src/components/guards/RequireAuth.tsx": "Protects content by requiring user authentication and prompts login if not signed in.",
  "frontend/src/components/layout/EditorialSection.tsx": "Provides styled editorial layout elements including section, headline, subhead, and divider components.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, legal links, browse links, and a caffeine.ai attribution line.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header with navigation, login button, admin/user links, and a responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on identity, initializing access control and invalidating queries on change.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks to get user role and admin status using react-query and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context/provider with login, logout, and identity restoration via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines many react-query hooks for profiles, bookings, and earnings, wrapping backend actor calls and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark theme variables and global styles including serif font import.",
  "frontend/src/lib/errorFormatting.ts": "Maps backend error messages to user-friendly strings for authorization, fee, and existence errors.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminBookingDetailPage.tsx": "Admin page showing detailed booking info with controls to update booking status and refresh earnings data.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Admin bookings list with tab-based filtering and navigation to individual booking detail pages.",
  "frontend/src/pages/admin/AdminEarningsPage.tsx": "Displays platform earnings, active monetization model, and recent completed bookings using fetched earnings, config, and bookings data.",
  "frontend/src/pages/admin/AdminMonetizationSettingsPage.tsx": "Loads and edits monetization config, allowing admins to select a revenue model and update related fee parameters.",
  "frontend/src/pages/admin/AdminProfileEditorPage.tsx": "Provides a form to create or edit a profile, preloading existing data and submitting updates via API.",
  "frontend/src/pages/admin/AdminProfilesPage.tsx": "Lists all profiles with status controls and navigation to create or edit profiles.",
  "frontend/src/pages/BrowseCompanionsPage.tsx": "Lists active companion profiles with search, category, and city filters and displays results in a responsive grid.",
  "frontend/src/pages/CompanionProfilePage.tsx": "Shows a detailed companion profile with gallery, details, and booking dialog trigger, handling missing profiles.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero, feature highlights, and calls to action linking to the browse page.",
  "frontend/src/pages/messages/MessagesConversationPage.tsx": "Shows a message thread between two participants, handles sending new messages, and manages loading or error states.",
  "frontend/src/pages/messages/MessagesInboxPage.tsx": "Displays a user's message inbox by loading message threads, filtering unique counterparts, and linking to conversation pages.",
  "frontend/src/pages/MyCompanionProfilePage.tsx": "Form page for creating or editing a companion profile, handling identity lookup, validation, and profile submission.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page outlining data collection, storage, rights, and security practices.",
  "frontend/src/pages/TermsDisclaimerPage.tsx": "Static terms and disclaimer page covering age requirements, legality, liability, and booking rules.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL parameters with sessionStorage persistence and hash-based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Project state file describing scope, features, architectural notes, and metadata for version tracking."
}