{
  "backend/main.mo": "Defines data models for profiles, bookings, messages, monetization, and system state maps with authorization and helper functions.",
  "feature_evidence.json": "Lists feature evidence records describing compliance gate, routing integration, and launch-readiness checks with associated files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables, dark mode overrides, and global element styling.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout, guards, and page routes wrapped by CommissionComplianceGate.",
  "frontend/src/components/admin/ProfileStatusBadge.tsx": "Renders a styled badge showing a companion profile’s status.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to set their display name and saves it via backend mutation.",
  "frontend/src/components/bookings/BookingRequestDialog.tsx": "Form dialog for submitting a booking request, validating inputs and sending data via a mutation hook.",
  "frontend/src/components/companions/CompanionCard.tsx": "Displays a companion profile card with image, name, description, category, and location, linking to the profile page.",
  "frontend/src/components/companions/CompanionGallery.tsx": "Image gallery with modal viewer allowing navigation between companion photos.",
  "frontend/src/components/compliance/AgeGateModal.tsx": "Modal requiring users to confirm age before entering, with accept and decline actions.",
  "frontend/src/components/compliance/CommissionComplianceGate.tsx": "Wrapper that checks user ban status and unpaid commissions, showing gating screens or allowing access accordingly.",
  "frontend/src/components/guards/RequireAdmin.tsx": "Guard component that requires authentication and admin privileges before rendering children.",
  "frontend/src/components/guards/RequireAgeGate.tsx": "Enforces age confirmation using local storage and shows the age‑gate modal if not verified.",
  "frontend/src/components/guards/RequireAuth.tsx": "Protects routes by requiring user authentication via Internet Identity.",
  "frontend/src/components/layout/EditorialSection.tsx": "Layout helpers for editorial‑style sections including headline, subhead, and dividers.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, legal links, browse links, and attribution including dynamic year.",
  "frontend/src/components/layout/SiteHeader.tsx": "Header component showing navigation links based on auth state, with mobile menu support and login button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAuthz.ts": "Provides user authorization info by querying the backend for role and admin status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth lifecycle, exposing identity, login, logout, and status.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for profiles, compliance, commissions, and earnings using the actor.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light and dark modes with luxury palette.",
  "frontend/src/lib/errorFormatting.ts": "Maps backend error messages to user-friendly strings including ban, commission, and authorization cases.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider around the root app.",
  "frontend/src/pages/admin/AdminBookingDetailPage.tsx": "Admin view for inspecting booking details and updating booking status with query invalidation.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Admin page listing bookings with tab-based filtering, status badges, and navigation to booking details.",
  "frontend/src/pages/admin/AdminEarningsPage.tsx": "Admin dashboard displaying earnings, monetization model details, and recent completed bookings.",
  "frontend/src/pages/admin/AdminMonetizationSettingsPage.tsx": "Form-driven page for viewing and updating monetization configuration, including model selection and fee inputs.",
  "frontend/src/pages/admin/AdminProfileEditorPage.tsx": "Page for creating or editing a profile with fields for personal details, status, and validation before saving.",
  "frontend/src/pages/admin/AdminProfilesPage.tsx": "Admin interface listing profiles with actions to create, edit, or change status via dropdown controls.",
  "frontend/src/pages/BrowseCompanionsPage.tsx": "Companion browsing page with search, category and city filters, and profile listing.",
  "frontend/src/pages/CompanionProfilePage.tsx": "Displays a companion's profile with images, details, and a booking dialog, handling missing profiles and auth-gated booking actions.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with a hero section, feature highlights, and calls to browse available companions.",
  "frontend/src/pages/messages/MessagesConversationPage.tsx": "Renders a full conversation view between the logged‑in user and another principal, loading messages, handling errors, and sending new messages. Includes auto-scrolling, profile lookup, and message mutation logic.",
  "frontend/src/pages/messages/MessagesInboxPage.tsx": "Displays the user's message threads, deduplicates them by counterpart principal, and links to each conversation. Shows loading state and empty-state messaging.",
  "frontend/src/pages/MyCompanionProfilePage.tsx": "Allows a signed-in user to create or edit their companion profile with form validation and submission handling.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders a static privacy policy describing data collection, usage, storage, and user rights.",
  "frontend/src/pages/TermsDisclaimerPage.tsx": "Displays legal terms and disclaimers regarding age requirements, permitted services, and liability.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters, persist them in sessionStorage, and clear them from URL hashes. Supports both standard and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and layout utilities with custom theme tokens. Registers plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project's current scope, architecture notes, known issues, and implemented features with versioning metadata."
}