{
  "kind": "build_request",
  "title": "Set commission-per-booking to 30%",
  "projectName": "Velvet Companions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Set the platform monetization configuration to use the commission-per-booking model with a 30% commission rate, so that platform earnings increase by 30% of the booking amount when an admin marks a booking request as completed.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I want to Charge a commission per booking. i want 30% charge from each booking"
        ]
      },
      "acceptanceCriteria": [
        "The backend default `activeMonetizationConfig` is `#commission` with `commissionRate = 30` (percent).",
        "When an admin updates a booking request status to `#completed` and the active model is commission, the platform earnings increase by `(avgPrice * 30) / 100`, where `avgPrice = (priceRange.min + priceRange.max) / 2` for the booked companion profile.",
        "`getActiveMonetizationConfig()` returns `model = #commission` and `commissionRate = 30` for admins on a fresh deploy (no prior config updates)."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Ensure the admin UI reflects the 30% commission setting by showing the current commission rate from the backend monetization config in the Monetization Settings page and the Earnings Dashboard page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "i want 30% charge from each booking"
        ]
      },
      "acceptanceCriteria": [
        "On the Admin Monetization Settings page, when the active model is Commission, the Commission Rate input is pre-filled with the backend value (30 on a fresh deploy).",
        "On the Admin Earnings Dashboard page, when the active model is Commission, the label shows \"30% per booking\" (or the current configured percent if changed later)."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko backend logic within the existing single actor in backend/main.mo.",
    "Do not modify files under frontend/src/components/ui or any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Integrating real payment processing or collecting actual commission payments.",
    "Adding new monetization models beyond those already implemented.",
    "Changing booking request workflow or statuses beyond applying the configured commission rate."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}